PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_rsa.c
        if (NULL != encodingArr)
        {
            oidSize = encodingArr[5u];
        }

        encodingArrRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(encodingArr);

        if (CY_CRYPTO_MODE_SHA_NONE == digestType)
        {
            // 3bytes for signature header & padding delimiter and 8 bytes for minimal padding.
            if (signatureLength < locDigestSize + 3u + 8u)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }
        else
        {
            if (signatureLength < 10u + locDigestSize + oidSize + 3u +8u)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }

            if (locDigestSize != digestLength)
            {
                return CY_CRYPTO_BAD_PARAMS;
            }
        }


        psLength = signatureLength - locDigestSize - encodingArrSize - 3u;

        /* Set the beginning of message to 0x00, 0x01*/
        *signaturePtr++ = 0x00u;
        *signaturePtr++ = 0x01u;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)(signature), (int32_t)signatureLength);
        SCB_CleanDCache_by_Addr((volatile void *)(digest), (int32_t)digestLength);

#endif

        signatureRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(signaturePtr);

        Cy_Crypto_Core_MemSet(base, signatureRemap, 0xFF, (uint16_t)psLength);
        signaturePtr += psLength;


#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_InvalidateDCache_by_Addr((volatile void *)(signature), (int32_t)signatureLength);
#endif
        /* After PS string (before T string) Set to 0x00 byte.*/
        *signaturePtr++ = 0x00;

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_CleanDCache_by_Addr((volatile void *)(signature), (int32_t)signatureLength);

#endif
        if (CY_CRYPTO_MODE_SHA_NONE != digestType)
        {
            signatureRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(signaturePtr);
            Cy_Crypto_Core_MemCpy(base, signatureRemap, encodingArrRemap, (uint16_t)encodingArrSize);
            signaturePtr += encodingArrSize;
        }

        signatureRemap = (uint8_t *)CY_REMAP_ADDRESS_FOR_CRYPTO(signaturePtr);
        Cy_Crypto_Core_MemCpy(base, (void *)signatureRemap, (void const *)digestRemap, (uint16_t)locDigestSize);

#if (((CY_CPU_CORTEX_M7) && defined (ENABLE_CM7_DATA_CACHE)) || CY_CPU_CORTEX_M55)
        /* Flush the cache */
        SCB_InvalidateDCache_by_Addr((volatile void *)(signature), (int32_t)signatureLength);
#endif
    }

    return (tmpResult);
}

#endif


/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontCoeff
****************************************************************************//**
*
* Calculation of Montgomery coefficients for Montgomery multiplication in GF(p).
*
* Reference: "Montgomery Multiplication", H. S. Warren, Jr., July 2012
* Reference: http://www.hackersdelight.org/MontgomeryMultiplication.pdf
*
* GCD method is used, reference:
* https://en.wikipedia.org/wiki/Binary_GCD_algorithm
*
* Inputs: modulus n, k = number of bits in n;
* Outputs: R^-1 and n' which allows equation: R*R^-1 - n*n' = 1,
* where R = 1 << size.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param modDerReg
* Register index for Montgomery coefficient value.
*
* \param modReg
* Register index for modulo value.
*
* \param size
* Modulo size in bits.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_Rsa_MontCoeff(CRYPTO_Type *base, uint32_t modDerReg, uint32_t modReg, uint32_t size)
{
    uint32_t myMod  = 9u;
    uint32_t tmp    = 10u;
    uint32_t ra      = 11u;
    uint32_t rb      = 12u;
    uint32_t ru      = 13u;
    uint32_t rv      = 14u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    uint32_t status;
    uint32_t aZero;
    uint32_t uEven;

    CY_CRYPTO_VU_PUSH_REG(base);

    CY_CRYPTO_VU_LD_REG(base, rv,     modDerReg);
    CY_CRYPTO_VU_LD_REG(base, myMod, modReg);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, ra, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, rb, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, ru, size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_TO_ONE(base, ru);
    CY_CRYPTO_VU_SET_TO_ZERO(base, rv);

    CY_CRYPTO_VU_SET_TO_ZERO(base, ra);
    CY_CRYPTO_VU_SET_REG(base, tmp, (size - 1u), 1u);

    CY_CRYPTO_VU_SET_BIT(base, ra, tmp);
    CY_CRYPTO_VU_MOV(base, rb, myMod);

    while (true)
    {
        Cy_Crypto_Core_Vu_WaitForComplete(base);

        CY_CRYPTO_VU_TST(base, ra);

        status = Cy_Crypto_Core_Vu_StatusRead(base);
        aZero = status &  CY_CRYPTO_VU_STATUS_ZERO_BIT;

        if (aZero != 0u)
        {
            break;
        }

        CY_CRYPTO_VU_LSR1(base, ra, ra);

        CY_CRYPTO_VU_TST(base, ru);
        status = Cy_Crypto_Core_Vu_StatusRead(base);
        uEven = status & CY_CRYPTO_VU_STATUS_EVEN_BIT;

        if (uEven != 0u)
        {
            CY_CRYPTO_VU_LSR1(base, ru, ru);
            CY_CRYPTO_VU_LSR1(base, rv, rv);
        }
        else
        {
            CY_CRYPTO_VU_ADD(base, ru, ru, rb);
            CY_CRYPTO_VU_LSR1_WITH_CARRY(base, ru, ru);
            CY_CRYPTO_VU_LSR1(base, rv, rv);
            CY_CRYPTO_VU_SET_BIT(base, rv, tmp);
        }
    }

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(ra) | CY_CRYPTO_VU_REG_BIT(rb) | CY_CRYPTO_VU_REG_BIT(ru));

    CY_CRYPTO_VU_POP_REG(base);

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_BarrettGetU
****************************************************************************//**
*
* Calculation of Barrett coefficient for Barrett reduction in GF(p).
*
* The function reduces the size of the Barrett coefficient by removing leading '0' bits.
* This improves the performance of the Barrett reduction (faster multiplication).
* (1 << bit_size) > mod > (1 << (bit_size-1))
*
* barrett = (1 << (2 * size)) / mod      NO!!! leading '1' Barrett bit.
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param barrettUReg
* Register index for Barrett reduction value.
*
* \param modReg
* Register index for modulo value.
*
* \param size
* The modulo size in bits.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_Rsa_BarrettGetU(CRYPTO_Type *base, uint32_t barrettUReg, uint32_t modReg, uint32_t size)
{
    uint32_t dividend = 0u;
    uint32_t t        = 1u;
    uint32_t temp     = 2u;
    uint32_t sh       = 3u;
    int32_t i;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, dividend, size + 1u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t,        size + 1u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, temp,     size + 1u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* (1 << size) - there is probably a more efficient way to initialize this */
    CY_CRYPTO_VU_SET_REG(base, sh, size, 1u);
    CY_CRYPTO_VU_SET_TO_ZERO(base, dividend);
    CY_CRYPTO_VU_SET_BIT(base, dividend, sh);

