PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/source/cy_crypto_core_rsa.c
    CY_CRYPTO_VU_MOV(base, temp, dividend);

    CY_CRYPTO_VU_SET_TO_ZERO(base, barrettUReg);

    for (i = (int32_t)size; i >= 0; i--)
    {
        /* C = (a >= b) */
        CY_CRYPTO_VU_SUB(base, t, dividend, modReg);
        CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_CS, dividend, t);
        CY_CRYPTO_VU_COND_XOR(base, CY_CRYPTO_VU_COND_CS, barrettUReg, barrettUReg, temp);
        CY_CRYPTO_VU_LSL1(base, dividend, dividend);
        CY_CRYPTO_VU_LSR1(base, temp, temp);
    }

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(dividend) | CY_CRYPTO_VU_REG_BIT(temp) | CY_CRYPTO_VU_REG_BIT(t));

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontTransform
****************************************************************************//**
*
* \brief Conversion to Montgomery representation.
*
* z = (a << size) % mod
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param z
* Register index for Montgomery representation value.
*
* \param a
* Register index for regular representation value.
*
* \param barrett
* Register index for Barrett reduction value.
*
* \param mod
* Register index for modulo value.
*
* \param size
* Bit size.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_Rsa_MontTransform(CRYPTO_Type *base, uint32_t z, uint32_t a, uint32_t barrett, uint32_t mod, uint32_t size)
{
    uint32_t sh      = 0u;
    uint32_t t1Plus2 = 1u;
    uint32_t t2Plus2 = 0u;
    uint32_t tDouble = 2u;
    uint32_t aDouble = 3u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, tDouble, 2u * size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, aDouble, 2u * size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh, size, 1u);

    CY_CRYPTO_VU_UMUL(base, tDouble, a, barrett);
    CY_CRYPTO_VU_LSR(base, aDouble, tDouble, sh);

    CY_CRYPTO_VU_UMUL(base, tDouble, aDouble, mod);

    CY_CRYPTO_VU_LSL(base, aDouble, a, sh);

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t2Plus2, size + 2u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SUB(base, t2Plus2, aDouble, tDouble);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(aDouble) | CY_CRYPTO_VU_REG_BIT(tDouble));

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t1Plus2, size + 2u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    /* Check CARRY = (a >= b) */
    CY_CRYPTO_VU_SUB(base, t1Plus2, t2Plus2, mod);
    CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_CC, t1Plus2, t2Plus2);

    /* Check CARRY = (a >= b) */
    CY_CRYPTO_VU_SUB(base, t2Plus2, t1Plus2, mod);
    CY_CRYPTO_VU_COND_MOV(base, CY_CRYPTO_VU_COND_CC, z, t1Plus2);
    CY_CRYPTO_VU_COND_MOV(base, CY_CRYPTO_VU_COND_CS, z, t2Plus2);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(t2Plus2) | CY_CRYPTO_VU_REG_BIT(t1Plus2));

    return CY_CRYPTO_SUCCESS;
}

/*******************************************************************************
* Function Name: Cy_Crypto_Core_Rsa_MontMul
****************************************************************************//**
*
* Montgomery multiplication in GF(p).
*
* z = a * b * r % mod
*
* t = mont_a * mont_b
* u = t * montModDer    "only lower 32 bits are needed"
* u = u * mod
* u = u + t
* u = u >> size
* u = IF (u >= mod) u = u - mod
*
* \param base
* The pointer to the CRYPTO instance.
*
* \param z
* Register index for product value.
*
* \param a
* Register index for multiplicand value.
*
* \param b
* Register index for multiplier value.
*
* \param montModDer
* Register index for Montgomery coefficient value.
*
* \param mod
* Register index for modulo value.
*
* \param size
* Bit size.
*
* \return
* \ref cy_en_crypto_status_t
*******************************************************************************/
static cy_en_crypto_status_t Cy_Crypto_Core_Rsa_MontMul(CRYPTO_Type *base,
        uint32_t z, uint32_t a, uint32_t b,
        uint32_t montModDer, uint32_t mod, uint32_t size)
{
    uint32_t sh       = 0u;
    uint32_t t        = 1u;
    uint32_t uDouble = 2u;
    uint32_t tDouble = 3u;
    uint32_t status = 4u;
    cy_en_crypto_status_t tmpResult = CY_CRYPTO_BAD_PARAMS;

    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, t,       size + 1u);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, uDouble, 2u * size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }
    tmpResult = CY_CRYPTO_VU_ALLOC_MEM(base, tDouble, 2u * size);
    if (CY_CRYPTO_SUCCESS != tmpResult)
    {
        return tmpResult;
    }

    CY_CRYPTO_VU_SET_REG(base, sh, size, 1u);

    CY_CRYPTO_VU_UMUL(base, tDouble, a, b);

    /* Only the lower 32 bits are needed. */
    CY_CRYPTO_VU_UMUL(base, t, tDouble, montModDer);

    /* Clear the MSB bit (cut to size length) */
    CY_CRYPTO_VU_LSL1(base, t, t);
    CY_CRYPTO_VU_LSR1(base, t, t);

    CY_CRYPTO_VU_UMUL(base, uDouble, t, mod);

    CY_CRYPTO_VU_ADD(base, uDouble, uDouble, tDouble);

    CY_CRYPTO_VU_MOV_STATUS_TO_REG(base, status);

    CY_CRYPTO_VU_LSR(base, uDouble, uDouble, sh);

    CY_CRYPTO_VU_SET_TO_ZERO(base, t);
    CY_CRYPTO_VU_SET_REG(base, sh, 0u,    1u);
    CY_CRYPTO_VU_SET_BIT(base, t,  sh);
    CY_CRYPTO_VU_SET_REG(base, sh, size, 1u);
    CY_CRYPTO_VU_LSL(base, t,  t,    sh);

    CY_CRYPTO_VU_MOV_REG_TO_STATUS(base, status);
    Cy_Crypto_Core_Vu_WaitForComplete(base);

    CY_CRYPTO_VU_XOR(base, tDouble, uDouble, t);
    CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_CS, uDouble, tDouble);

    /* C = (a >= b) */
    CY_CRYPTO_VU_SUB(base, tDouble, uDouble, mod);
    CY_CRYPTO_VU_COND_SWAP_REG(base, CY_CRYPTO_VU_COND_CS, uDouble, tDouble);

    CY_CRYPTO_VU_MOV(base, z, uDouble);

    CY_CRYPTO_VU_FREE_MEM(base, CY_CRYPTO_VU_REG_BIT(tDouble) | CY_CRYPTO_VU_REG_BIT(uDouble) | CY_CRYPTO_VU_REG_BIT(t));

